<?php

//================================
// ログ
//================================
//ログを取るか
ini_set('log_errors','on');
//ログの出力ファイルを指定
ini_set('error_log','php.log');

//================================
// デバッグ
//================================
//デバッグフラグ
$debug_flg = true;
//デバッグログ関数
function debug($str){
  global $debug_flg;
  if(!empty($debug_flg)){
    error_log('デバッグ：'.$str);
  }
}

//================================
// 定数
//================================
define('MSG01','入力必須です');


//================================
// グローバル変数
//================================
// エラーメッセージ格納用の配列
$err_msg = array();

//================================
// バリデーション関数
//================================

// 未入力チェック
function validRequired($str,$key){
  if(empty($str)){
    global $err_msg;
    $err_msg[$key] = MSG01;
  }
}


 ?>